Repository: common-repository/wp-wdfy-integration-of-wodify
Catalog: languages/wp-wdfy-integration-of-wodify-*.po
Languages: de_de

source: REST-API/Alexa-API Settings
de_de: REST-API/Alexa-API Einstellungen

source: Save all settings
de_de: Alle Einstellungen speichern

source: Schema.org Options
de_de: Schema.org Optionen

source: Scroll classes automatically?
de_de: Kalender automatisch scollen?

source: Set to "false" in order to always access Wodify and disable local caching, defaults to "true".
de_de: "false" um das Caching zu deaktivieren und bei jedem Seitenaufruf direkt auf Wodify zuzugreifen. Vorgabewert ist "true".

source: Settings
de_de: Einstellungen

source: Shortcode Documentation
de_de: Shortcode Dokumentation

source: Show a list of classes for the selected program with default settings
de_de: Zeige eine Liste von Classes des gewählten Programs mit den Voreinstellungen.

source: Show only following WOD components (Separate component names with comma, leave empty to show all):
de_de: Nur die folgenden WOD-Komponenten anzeigen (Mehrere Komponenten-Namen durch Komma getrennt, Feld leer lassen um alles anzuzeigen):

source: Show only specific columns, a custom date format, and include headers in the table
de_de: Zeige nur bestimmte Spalten, ein benutzerdefiniertes Datumsformat, und zeige Spaltenüberschriften an.

source: Show only the following programs (Separate program names with comma, leave empty to show all):
de_de: Nur die folgenden Programme anzeigen (Mehrere Programm-Namen durch Komma getrennt, Feld leer lassen um alles anzuzeigen):

source: Show tomorrow's WOD without respecting Wodify publish settings. Do not show the header information and the Warm-up section. Do not include WOD images.
de_de: Zeige das morgige WOD an ohne die Wodify-Veröffentlichungseinstellungen zu berücksichtigen. Zeige keine Überschriften-Informationen und kein Warm-up an. Zeige keine Bilder an.

source: Show WOD images by default?
de_de: WOD Bilder standardmäßig anzeigen?

source: Show wod images?
de_de: WOD-Bilder anzeigen?

source: Sorry, I could not find a suitable program, but I will try %s for you
de_de: Ich konnte leider kein passendes Programm finden, aber ich versuche es mal mit %s

source: Sorry, no workout is available for that day.
de_de: Fuer diesen Tag ist leider kein Workout verfuegbar.

source: Sorry, the magical number is wrong..
de_de: Die magische Zahl ist leider falsch.

source: spaces reserved.
de_de: Plätze reserviert.

source: Specifies the date to get the speakable text for in ISO8601 date format, e.g. 2021-01-21
de_de: Gibt das Datum im ISO8601 Format an, für das der zu sprechende Text abgerufen werden soll, z.B. 2024-01-21

source: Specifies the program to get the WOD for using one of the short names defined above
de_de: Gibt den Namen des Programs an um eine der oben definierten Kurzbezeichnungen zu verwenden.

source: Successfully connected to Wodify.<br>Reload page to check again.
de_de: Erfolgreich mit Wodify verbunden.<br> Lade die Seite neu um die Verbindung erneut zu prüfen.

source: The API takes 4 mandatory parameters in the URL, which must all be specified, even if only a default value is passed
de_de: Die API nimmt 4 obligatorische Parameter in der URL entgegen, die alle angegeben sein müssen, selbst wenn nur ein Default Wert übergeben wird.

source: The following two settings define when posts will be created. You can setup the actual publish date of each post per program below. However, if you chose immediate publishing, posts will be on your website as soon as they are created.
de_de: Die folgenden zwei Einstellungen definieren, wann Beiträge erstellt werden. Das eigentliche Veröffentlichungsdatum legst du weiter unten pro Programm fest. Wenn du dort allerdings die sofortige Veröffentlichung auswählst, erscheinen die Posts auf deiner Webseite, sobald sie erstellt wurden.

source: The numeric password (numbers only!) setup above, pass 0 if not used.
de_de: Das oben eingerichtete numerische Passwort (nur Ziffern!), 0 wenn nicht verwendet.

source: The output will be a JSON containing only the <code>speakOutput</code> element.
de_de: Der Output ist im JSON Format, der nur das <code>speakOutput</code> element enthält.

source: The REST-API for WP WDFY on your site has one method <strong><code>wod-alexa</code></strong> that is available at the following address:
de_de: Die REST_API für WP WDSFY auf deiner Seite hat eine Methode <strong><code>wod-alexa</code></strong>, die unter der folgenden Adresse verfügbar ist:

source: The resulting file will not contain any login information or your API key.
de_de: Diese Datei enthält weder Login-Daten noch deinen API-Key.

source: The workout is not yet available. Please ask me again later.
de_de: Das Workout ist noch nicht verfuegbar. Bitte frag mich spaeter noch mal.

source: This plugin is provided by <a href="http://www.amrap42.de" target="_blank">AMRAP42 - Stefan Osterburg</a>.
de_de: Dieses Plugin wird von AMRAP42 - Stefan Osterburg bereit gestellt.

source: This plugin normally respects this setting, if you do not explicitely chose to ignore it in a widget or shortcode. The following setting specifies, which of the two dates the plugin should use.
de_de: Dieses Plugin respektiert normalerweise die Wodify-Einstellung, wenn du nicht im Widget oder Shortcode explizit festlegst, diese zu ignorieren. Die folgende Einstellung legt fest, welches der beiden Daten genutzt werden soll.

source: This plugin provides the following shortcodes that you can use in your posts and pages. Please note that most attributes are case-sensitive.
de_de: Das Plugin stellt die folgenden Shortcodes zur Verwendung in deinen Beiträgen und Seiten zur Verfügung. Beachte bitte, dass die meisten Attributwerte Groß- und Kleinschreibung unterscheiden.

source: Time
de_de: Zeit

source: Time of class
de_de: Uhrzeit der Class

source: Title:
de_de: Titel:

source: To find you API Key please see the description on this <a href="%s" target="_blank" rel="noopener noreferrer">Wodify Support page</a>.
de_de: Um deinen API-Key zu finden, folge bitte der Beschreibung auf dieser <a href="%s" target="_blank" rel="noopener noreferrer">Wodify Support Seite</a>.

source: To have a specific WOD post recreated, you can simply delete the post (Move to trash AND empty trash!). The post will be recreated the next time WOD posting is activated by the cron mechanism.
de_de: Um einen bestimmten Beitrag zu einem WOD erneut erstellen zu lassen, kannst du den Beitrag einfach löschen (In den Papierkorb verschieben UND den Papierkorb leeren!). Der Beitrag wird dann erneut erstellt, sobald der Cron Mechanismus wieder aktiviert wird.

source: Today
de_de: Heute

source: Today + 2 days
de_de: Übermorgen

source: Today + 3 days
de_de: Heute + 3 Tage

source: Today + 4 days
de_de: Heute + 4 Tage

source: Today + 5 days
de_de: Heute + 5 Tage

source: Today + 6 days
de_de: Heute + 6 Tage

source: Today +2 days
de_de: Heute +2 Tage

source: Today +3 days
de_de: Heute +3 Tage

source: Today +4 days
de_de: Heute +4 Tage

source: Today +5 days
de_de: Heute +5 Tage

source: Today +6 days
de_de: Heute +6 Tage

source: Today - 2 days
de_de: Vorgestern

source: Today - 3 days
de_de: Heute - 3 Tage

source: Today - 4 days
de_de: Heute - 4 Tage

source: Today - 5 days
de_de: Heute - 5 Tage

source: Today - 6 days
de_de: Heute - 6 Tage

source: Today and Tomorrow
de_de: Heute und morgen

source: Tomorrow
de_de: Morgen

source: Upcoming classes
de_de: Bevorstehende Kurse

source: Use "nextmonth" to list event from 1st of next month. Otherwise events beginning from the current date will be displayed.
de_de: Verwende "nextmonth" um Events beginnend am Ersten des nächsten Monats aufzulisten. Andernfalls werden Evebts ab dem aktuellen Datum angezeigt.

source: Use cached calendar if available
de_de: Kalender Cache verwenden wenn verfügbar

source: Use custom date format.
de_de: Benutzerdefiniertes Datumsformat verwenden.

source: Visual reservation status
de_de: Grafischer Reservierungsstatus

source: will give you the workout for 2021-01-22 and the program you mapped to the shortname "crossfit" above formatted for Alexa, assuming you have not set a password.
de_de: Gibt das Workout für das angebene Datum und das Program, das auf die Kurzbezeichnung "crossfit" gemappt ist für Alexa formatiert zurück, vorausgesetzt, es wurde kein Passwort eingerichtet.

source: WOD day:
de_de: WOD Datum:

source: WOD Images
de_de: WOD Bilder

source: WOD not yet available. Please come back later!
de_de: WOD noch nicht verfügbar. Bitte komme später wieder!

source: WOD Posting
de_de: WOD-Beitragserstellung

source: WOD Publish offset in hours (Show WOD earlier or later than Wodify publish date, negative values vor earlier):
de_de: WOD-Veröffentlichungsabweichung in Stunden (Zeige das WOD früher oder später an als durch das Wodify Publish Date festgelegt, verwende negative Werte für früher):

source: WOD Publishing Settings
de_de: WOD-Veröffentlichungseinstellungen

source: WOD Settings
de_de: WOD Einstellungen

source: Wodify / API program mappings
de_de: Wodify / API Programm Zuordnung

source: Wodify Integration Settings
de_de: Wodify Integration Einstellungen

source: Wodify page to link to. "wod" (default) | "calendar" | "whiteboard" | "home"
de_de: Wodify Seite zu der verlinkte wird. "wod" (Vorgabewert) | "calendar" | "whiteboard" | "home"

source: Wodify Program to map to
de_de: Zuzuordnendes Wodify Programm

source: Wodify publish date
de_de: Wodify Veröffentlichungsdatum

source: Wodify Settings
de_de: Wodify Plugin-Einstellungen

source: Wodify Time zone
de_de: Wodify Zeitzone

source: Wodify Upcoming Classes
de_de: Wodify Kalender

source: Wodify uses two publish dates: If WordPress posts are activated in Wodify, the <strong>Blog Publish Date</strong> specifies when Wodify is supposed to generate a WordPress post with the WOD. The <strong>Internal Publish Date</strong> specifies, when the WOD can be viewed within the Wodify app.
de_de: Wodify verwendet zwei verschiedene Publish Dates. Wenn automatische WordPress-Posts in Wodify aktiviert sind, gibt das <strong>Blog Publish Date</strong> an, wann Wodify den entsprechenden Post erzeugen soll. Das <strong>Internal Publish Date</strong> gibt an, wann das WOD in der Wodify App angezeigt werden kann.

source: WODs are cached automatically when they are first retrieved from Wodify through a shortcode, widget, or automated posts to minimize page load times for your visitors. To avoid that any visitor will trigger a Wodify API call, you can set up an external cron job that frequently loads the specific page(s) that display(s) the WOD. Use the URL parameter <em>updatewodcache</em> to trigger a cache refresh, e.g. <strong>%s/?updatewodcache</strong> will refresh the cache for a WOD displayed on your home page. A "No WOD found" message is cached for only 20 minutes. If you expect these messages to show up on your webpage, you should set the cron to load the page with a frequency of less than 20 minutes.
de_de: Um Seitenladezeiten für deine Besucher zu minimieren, werden WODs automatisch gecacht, wenn sie durch einen Shortcode, ein Widget oder die automatische Beitragserstellung das erste mal von Wodify abgerufen wurden. Um zu verhindern, dass totzdem ein Benutzer einen Wodify API Aufruf auslöst, empfiehlt es sich einen externen Cronjob einzurichten, der regelmäßig die Seiten abruft, die aktuelle WODs anzeigen. Verwende den URL Parameter <em>updatewodcache</em> um den Cache Refresh zu erzwingen, z.B. erneuert der Aufruf von <strong>%s/?updatewodcache</strong> den Cache des WODs, das auf deiner Homepage angezeigt wird. Die Nachricht, dass kein WOD gefunden wurde, wird nur für 20 Minuten gecacht. Wenn du damit rechnest, dass solche Nachrichten auf deiner Webseite angezeigt werden, sollte deine Seite häufiger als alle 20 Minuten durch den externen Cronjob aufgerufen werden.

source: WP WDFY can automatically create blog posts for your WODs, if the standard Wodify feature does not meet your requirements. It uses the Wordpress cron mechanism, which is triggered whenever users visit your site. On low traffic websites you might need to add a real cron job to load your page for triggering WOD posts.
de_de: WP WDFY kann automatisch Blog-Beiträge für deine Wodify-WOD erzeugen, wenn dir die von Wodify standardmäßig bereitgestellte Funktionalität nicht genügt. WP WDFY nutzt dafür den WordPress Cron Mechanismus, der immer dann ausgelöst wird, wenn ein Benutzer deine Seiten besucht. Auf Websites mit geringen Benutzerzahlen ist es ggf. sinnvoll, wenn du einen echten Cron-Job erstellst, der regelmäßig deine Seiten aufruft.

source: WP WDFY can provide a REST API to use in Alexa Skills or Siri shortcuts. <br>You can require a numeric password "magic number" to be sent with each request, a value of 0 means that this password will not be checked (but is still required as empty parameter in the API-call (see below).
de_de: WP WDFY can eine REST API zur Verfügung stellen, die in Alexa Skills oder Siri Kurzbefehlen verwendet werden kann. <br>Du kannst festlegen, dass ein numerische Passwort, die "magische Zahl" mit jedem API Request gesendet werden muss. Mit einem Wert von 0 wird dieses Passwort nicht geprüft (wird jedoch trotzdem als Parameter im API-Aufruf benötigt - siehe unten).

source: WP WDFY Integration of Wodify
de_de: WP WDFY Integration von Wodify

source: Yes
de_de: Ja

source: Yesterday
de_de: Gestern

source: You can also define an offset in hours to apply to the Wodify publish date to post your WOD earlier (negative values) or later than specified by Wodify.
de_de: Du kannst auch einen Offset definieren, der auf das Veröffentlichungsdatum von Wodify angewandt wird, um das WOD früher (negative Werte) oder später als in Wodify angegeben zu veröffentlichen.

source: You can also use the API to create a Siri shortcut on your iPhone/iPad. Again, I am not an expert on this, but the below image might give you an idea how to use the Shortcuts app.
de_de: Du kannst die API auch verwenden, um einen Kurzbefehl (für Siri) auf deinem iOS Gerät zu erstellen. Auch hierfür bin ich kein Experte, aber der Screenshot unten hilft vielleicht, einen Eindruck zu vermitteln, wie die Kurzbefehle App verwendet wird.

source: You can specify URLS for each Wodify coach. This will be used to link the coach name to the respective page when it is shown e.g. in the classes widget
de_de: Hier kannst du eine URL für jeden Coach aus Wodify festlegen. Diese wird verwendet um einen Link zu der entsprechenden Seite zu generieren wenn der Name des Coachs zum Beispiel im Kalender-Widget angezeigt wird.

source: You can use the following place holders for the post title:
de_de: Du kannst die folgenden Platzhalter für den Beitragstitel verwenden:
