Repository: common-repository/wp-wdfy-integration-of-wodify
Catalog: languages/wp-wdfy-integration-of-wodify-*.po
Languages: de_de

source: "color" | "color2" |"vcolor" | "vcolor2" colored logos (for white background) "2" indicates double size, "v" vertical logo
de_de: "color" | "color2" |"vcolor" | "vcolor2" farbige Logos (für weißen Hintergrund), "2" steht für doppelte Logogröße, "v" für vertikales Logo

source: "white" | "white2" |"vwhite" | "vwhite2" logos for white background "2" indicates double size, "v" vertical logo
de_de: "white" | "white2" |"vwhite" | "vwhite2" Logos für weißen Hintergrund, "2" steht für doppelte Logogröße, "v" für vertikales Logo

source: "black" | "black2" |"vblack" | "vblack2" logos for black background "2" indicates double size, "v" vertical logo
de_de: "black" | "black2" |"vblack" | "vblack2" Logos für schwarzen Hintergrund, "2" steht für doppelte Logogröße, "v" für vertikales Logo

source: "mobile" to link mobile web app, "desktop" to link to desktop web page. "auto" to use responsive css to determine link target, defaults to "auto"
de_de: "mobile" um zur Webanwednung für mobile Geräte zu verlinken, "desktop" zur Desktop-Webanwendung. "auto" um mittels Responsive CSS das Linkziel geräteabhängig zu bestimmen, Vorgabewert "auto".

source: "none" (default) create text link with text enclosed in shortcode (default Text: "Wodify")
de_de: "none" (Vorgabewert) fügt einen Textlink ein, mit dem Text, der in den Shortcode-Tag eingeschlossen ist (Default-Text: "Wodify")

source: "true" to open the link in a new tab, defaults to "false".
de_de: "true" um den Link in einem neuen Tab zu öffnen. Vorgabewert "false".

source: %1 for program name:
de_de: %1 für den Programm-Namen

source: %2 for WOD date
de_de: %2 für das WOD Datum

source: %3 for WOD name
de_de: %3 für den WOD Namen

source: (empty line)
de_de: (leere Zeile)

source: (no spaces or special characters)
de_de: (keine Leerzeichen oder Sonderzeichen)

source: (not used)
de_de: (nicht verwendet)

source: (Please select)
de_de: (Bitte w&auml;hlen)

source: 0 for Alexa, 1 for Siri. For Alexa linebreaks will be converted to speech pause markup, which Siri does not interpret.
de_de: 0 für Alexa. 1 für Siri. Für Alexa werden Zeilenumbrüche in Sprechpausen-Markup konvertiert, welche Siri nicht interpretiert.

source: About this plugin
de_de: Über dieses Plugin

source: About WP WDFY
de_de: Über WP WDFY

source: Additional schema.org JSON
de_de: Zusätzliches schema.org JSON

source: Address
de_de: Adresse

source: All
de_de: Alle

source: Allows you to override the general setting for images set "true" to show images, "false" to skip WOD images.
de_de: Ermöglicht Ihnen die Standardeinstellung zu überschreiben. Setze den Wert auf "true" um Bilder anzuzeigen "false" um keine Bilder anzuzeigen.

source: API documentation
de_de: API Dokumentation

source: API short name/id for program
de_de: API Kurzbezeichnung/ID für das Programm

source: Attributes
de_de: Attribute

source: Background color for this program in the calendar widget
de_de: Hintergrundfarbe des Programs im Kalender-Widget

source: Building Siri-Shortcuts
de_de: Erstellen von Siri-Kurzbefehlen

source: Building your own Alexa Skill
de_de: Erstellen eines eigenen Alexa-Skills

source: By default the shortcode will respect the BlogPublish Date set in Wodify. If this attribute is set to "true" the WOD will be displayed anyway if available.
de_de: Standardmäßig respektiert der Shortcode die Veröffentlichungseinstellungen aus Wodify (siehe auch Eisntellungseite WOD dieses Plugins). Wenn dieses Attribut auf "true" gesetzt ist, zeigt der Shortcode das WOD unabhängig davon an.

source: Cache Wodify WOD?
de_de: Wodify WOD cachen?

source: Caching frequency for Wodify classes information
de_de: Caching Häufigkeit für Wodify-Kalender-Informationen

source: Cancelled
de_de: Abgesagt

source: Category(s)
de_de: Katergorie(n)

source: Class name
de_de: Kursname

source: Class titles in calendar widget will be linked to the respective URL, e.g. a course description on your website.
de_de: Die einzelnen Classes im Kalenderwidget werden mit der entsprechenden URL verlinkt, z.B. einer Kursbeschreibung auf deiner Webseite.

source: Classes caching is used to reduce page load times for your visitors by avoiding Wodify API calls. If you are displaying reservation info in your classes widgets, you will probably need a higher frequency than if you don't. Caching uses the Wordpress cron mechanism, which is triggered whenever users visit your site. On low traffic websites you might need to add a real cron job to load your page for triggering caching.
de_de: Der Kalender Cache dient der Reduzierung der Seiten-Ladezeiten für die Besucher deiner Webseite durch das Vermeiden von Wodify API Aufrufen. Wenn du Reservierungsinformationen mit dem Kalender Widget auf deiner Seite anzeigst, wirst du den Cache vermutlich öfter aktualisieren wollen als im anderen Fall. Das Caching nutzt den Cron-Mechanismus von WordPress, der immer dann ausgelöst wird, wenn ein Besucher auf deine Seiten zugreift. Wenn deine Seite nur geringe Besucherzahlen aufweist, solltest du in Erwägung ziehen, einen "echten" Cron-Job einzurichten, der regelmäßig deine Seite aufruft, um das Caching auszulösen.

source: Classes Settings
de_de: Kalender Einstellungen

source: Coach About Page URL
de_de: Coach URL

source: Coach of the class
de_de: Coach der Class

source: Coaches Settings
de_de: Coaches Einstellungen

source: Comma seperated list of locations. Uses default location (General Options tab) if not specified
de_de: Komma-separierte Liste von Wodify Locations. Verwendet die Standard-Location, wenn nichts festgelegt ist

source: Comma seperated list of programs NOT to include from all active programs (see Classes settings tab).
de_de: Komma-separierte Liste von Wodify Programs von denen KEINE Classes angezeigt werden sollen.

source: Comma seperated list of programs to include classes from. If empty, all active programs (see classes settings tab) are used.
de_de: Komma-separierte Liste von Wodify Programs von denen Classes angezeigt werden sollen. wenn leer, werden alle aktiven Programs angezeigt.

source: Comma seperated list of the following values that defines the columns to display and their order
de_de: Komma-separierte Liste der folgenden Werte, die definiert welche Spalten in welcher Reihenfolge angezeigt werden sollen.

source: comma seperated list of WOD component names. If specified, components with the specified names will not be shown, names are case-sensitive. Use "Header" for the WOD header (name and comment) section, "Announcements" for announcemnts.
de_de: Komma-getrennte Liste von WOD-Komponenten-Namen. Wenn angegeben, werden die ausgewählten Komponenten NICHT angezeigt, dabei wird nach Groß- und Kleinschreibung unterschieden. Verwende "Header" für den Überschriftsabschnitt (Name und Kommentar), "Announcements" für Ankündigungen.

source: comma seperated list of WOD component names. If specified, only components with these names will be shown, names are case-sensitive. Use "Header" for the WOD header (name and comment) section, "Announcements" for announcemnts.
de_de: Komma-getrennte Liste von WOD-Komponenten-Namen. Wenn angegeben, werden nur die ausgewählten Komponenten angezeigt, dabei wird nach Groß- und Kleinschreibung unterschieden. Verwende "Header" um den Überschriftsabschnitt (Name und Kommentar) anzuzeigen, "Announcements" für Ankündigungen.

source: Content for "priceRange" attribute in the "location" section of the event markup. Typically, values such as $ = inexpensive, $$ = moderate, $$$ = expensive, $$$$ = very expensive are used.
de_de: Inhalt für das "priceRange" Attribut in der "location" Section des Event Markups. Üblicherweise werden hier Werte wie $ = billig, $$ = moderat, $$$ = teuer, $$$$ = sehr teuer verwendet.

source: Content for "telephone" in the "location" section of the event markup.
de_de: Inhalt für "telephone" in der "location" section des Event Markups.

source: Content for the "image" attribute in the "location" section of the event markup. Please provide a fully qualified image URL (incl. http/https). This will also be used as default for the event image. You can choose to make individual settings on the Programs settings page.
de_de: Inhalt für das "image" Attribut in der "location" section des Event Markups. Bitte gib eine vollständige Bild-URL (inkl. http/https) an. Diese wird auch als Vorgabewert für das Bild jedes einzelnen Events verwendet, wenn du keine individuellen Einstellungen pro Program festlegst.

source: Content line %d:
de_de: Inhalt Zeile %d:

source: Create Post
de_de: Beitrag erstellen

source: Currently no connection to Wodify.<br>Change API key and save settings, or reload page to check again.
de_de: Im Moment besteht keine Verbindung zu Wodify.<br>Ändere den API-Key und speichere die Einstellungen oder lade diese Seite neu, um die Verbindung noch einmal zu prüfen.

source: Date
de_de: Datum

source: Date in Format Y/m/d; or relative to today's date "+1", "+2", "-1", ...; or use "MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN" to display WOD for a specific upcoming weekday. Defaults to today's date.
de_de: Datum im Format Y/m/d; oder relativ zum heutigen Datum "+1", "+2", "-1", ...; oder verwende "MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN" um das WOD eines bestimmten kommenden Wochentags anzuzeigen. Vorgabewert ist das aktuelle Tagesdatum.

source: Date of class
de_de: Datum der Class

source: Days to create WOD posts in advance:
de_de: Anzahl der Tage, für die WOD-Beiträge im Voraus erstellt werden:

source: Days to show:
de_de: Anzahl anzuzeigender Tage:

source: Deactivate
de_de: Deaktivieren

source: Deactivate this program in calendar widget, event shortcode and blocks.
de_de: Deaktiviere dieses Program im Kalender Widget, Event Shortcode und Blocks.

source: Default Wodify Location to use for shortcodes and widgets
de_de: Vorgabewert für "Location" aus Wodify zur Verwendung in Shortcodes und Widgets.

source: Default Wodify Program to use for shortcodes and widgets
de_de: Vorgabewert für "Program" aus Wodify zur Verwendung in Shortcodes und Widgets.

source: Defines if a logo or text link is inserted and what logo is used:
de_de: Legt fest, ob ein Logo oder ein Textlink eingefügt wird:

source: Description URL
de_de: Beschreibungs-URL

source: DISCLAIMER: The plugin and its <a href="http://amrap42.28a.de" target="_blank" rel="noopener">author</a> are in no way associated with or endorsed by <a href="http://www.wodify.com" target="_blank" rel="noopener noreferrer">WODIFY</a>. The plugin relies on the API provided by Wodify.
de_de: DISCLAIMER: Dieses Plugin und sein <a href="http://amrap42.28a.de" target="_blank" rel="noopener">Autor</a> sind in keine Weise verbunden mit oder unterstützt von <a href="http://www.wodify.com" target="_blank" rel="noopener noreferrer">WODIFY</a>. Das Plugin nutzt das API, das von Wodify zur Verfügung gestellt wird.

source: Display (upcoming) Tuesday's WOD for default location and program.
de_de: Zeige das WOD des (kommenden) Dienstags für die Standard-Location und das Standard-Programm an.

source: Display todays's WOD for default location and program
de_de: Zeigt das heutige WOD für die Standard-Location und das Standard-Program an.

source: Display upcoming classes from Wodify
de_de: Zeige bevorstehende Kurse aus Wodify

source: Display WOD for the specified date, location, and program.
de_de: Zeigt das WOD für das angegebene Datum, Location und Program an.

source: Displays a WOD from Wodify
de_de: Zeigt ein WOD aus Wodify an

source: Do not show the following programs (Separate program names with comma, leave empty to show all):
de_de: Die folgenden Programme NICHT anzeigen (Mehrere Programm-Namen durch Komma getrennt, Feld leer lassen um alles anzuzeigen):

source: Do not show the following WOD components (Separate component names with comma, leave empty to show all):
de_de: Die folgenden WOD-Komponenten NICHT anzeigen (Mehrere Komponenten-Namen durch Komma getrennt, Feld leer lassen um alles anzuzeigen):

source: Download diagnostic information
de_de: Diagnoseinformationen herunterladen

source: Download WOD images to media library?
de_de: Bilder in Medienbibliothek laden?

source: Error accessing Wodify
de_de: Fehler beim Zugriff auf Wodify

source: Error accessing Wodify. Please check if you correctly entered and saved your API key.
de_de: Fehler beim Zugriff auf Wodify. Bitte überprüfe ob du deinen API-Key korrekt eingegeben und gespeichert hast.

source: Every 15 minutes
de_de: Alle 15 Minuten

source: Every 2 hours
de_de: Alle 2 Stunden

source: Every 30 minutes
de_de: Alle 30 Minuten

source: Every 4 hours
de_de: Alle 4 Stunden

source: Example
de_de: Beispiel

source: Example:<br><code>"offers": {"@type": "Offer","url": "http://yourwebsite.com",... }</code>
de_de: Beispiel:<br><code>"offers": {"@type": "Offer","url": "http://yourwebsite.com",... }</code>

source: Examples
de_de: Beispiele

source: Exclude components
de_de: Ausgeschlossene Komponenten

source: For advanced setting please use shortcode [wdfyevents].
de_de: Für erweiterte Einstellungen verwendet bitte den Shortcode [wdfyevents]

source: For schema.org event markup, please make sure to setup the site image and/or program image URLs in the plugin settings.
de_de: Für das schema.org Event Markup stelle bitte sicher, dass in den Plugin-Einstellungen die URLs für das Webseiten-Image und/oder die Program-Images konfiguriert sind.

source: For WOD images you can decide separately if you would like to include them in the post content and/or set the first image as post thumbnail.
de_de: Für WOD Bilder kannst du getrennt unterscheiden, ob sie in den Beitragsinhalt eingebettet werden sollen und/oder ob das erste Bild als Beitragsbild festgelegt werden soll.

source: Frequency to check for new Wodify WODs to post:
de_de: Häufigkeit der Prüfung nach neuen Wodify WODs zum Posten:

source: General Options
de_de: Allgemeine Einstellungen

source: Height (in pixels) of class box without hover:
de_de: Höhe der Kurs-Box (in Pixeln):

source: Here is just a quick and dirty example implementation of a <code>GetWorkout</code> intent:
de_de: Hier ist ein "quick-and-dirty" Beispiel für die Implementierung eines <code>GetWorkout</code> Intents:

source: I will not go into the details of describing the development of Alexa skills here, there is plenty of documentation out there for you to use. And I am also not an expert on Alexa skills, so I will hardly able to help you.
de_de: Ich werde nicht in die Details des Alexa-Skill Developments eintauchen, es gibt ausreichend Dokumentationen im Netz. Ich bin selbst auch keine Experte für Alexa Skills und werde deshalb kaum helfen können.

source: If set to "false" a schema.org event markup for each listed class will not be included in the page
de_de: Wenn "false" wird kein schema.org Event Markup erzeugt.

source: If set to "true" a table header will be included.
de_de: Wenn "true" gewählt wird, werden Spaltenüberschriften angezeigt.

source: If specified will be used instead of numdays. How many calendar months to display.
de_de: Wird, sofern angegeben, anstelle von numdays verwendet. Wieviele Kalender-Monate sollen angezeigt werden?

source: If you have contacted me with a plugin problem on your site, I might ask you to send me additional information. In this case please use the following button and send me the resulting text file in an e-mail.
de_de: Wenn du mich mit einem Problem des Plugins auf deiner Seite kontaktiert hast, bitte ich dich eventuell mir zusätzliche Informationen zu schicken. In diesem Fall nutze bitte den folgenden Button und sende mir die entstandene text-Datei.

source: If you have ideas, problems or suggestions you can find the relevant contact information on <a href=" http://amrap42.28a.de/contact/" target="_blank" rel="noopener">http://amrap42.28a.de/contact/</a>.
de_de: Wenn du Ideen, Probleme oder Vorschläge hast, findest du die notwendigen Kontaktinformationen unter <a href=" http://amrap42.28a.de/contact/" target="_blank" rel="noopener">http://amrap42.28a.de/contact/</a>.

source: If you intend to use schema.org markup, please make sure to setup the values for various attributes in the plugin general and program settings.
de_de: Wenn du beabsichtigst, das schema.org Markup zu nutzen, stelle bitte sicher, dass die Standardwerte für verschiedene Attribute in den Allgemeinen und den Programmeinstellungen des Plugins hinterlegt sind.

source: If you like the plugin and find it valuable for your site, please support me as the author - any amount will be appreciated.
de_de: Wenn das Plugin wertvoll und hilfreich für deine Webseite ist, würde ich mich freuen wenn du mich unterstützen würdest - jeder Beitrag ist willkommen.

source: If you use the [wdfyevents] shortcode or editor block this will create a <a href="https://schema.org/Event" target=_blank" rel="noopener noreferrer">schema.org event markup</a> for search engines. Use these options to define the attributes. Please note that more settings should be made in the Programs settings section.
de_de: Wenn du den [wdfyevents] Shortcode oder Editor Block benutzt, wird automatisch ein <a href="https://schema.org/Event" target=_blank" rel="noopener noreferrer">schema.org Event Markup</a> für Suchmaschinen generiert. Verwende die folgenden Optionen, um die Attribute zu definieren. Bitte beachte, dass einige zusätzliche Einstellungen unter "Programs" vorgenommen werden sollten.

source: If you use the [wdfyevents] shortcode or editor block this will create a schema.org event markup for search engines. Please enter a fully qualified URL (inkl. http/https of an image that can be used for this event markup specifica for each program.
de_de: Wenn du den [wdfyevents] Shortcode verwendest, wird automatisch ein schema.org event markup für Suchmaschinen erzeugt. Bitte gib hier eine vollständige URL (inkl. http/https) eines Bilds ein, das spezifisch für jedes Program für dieses Markup verwendet werden kann.

source: Ignore Wodify WOD publish date:
de_de: Wodify Veröffentlichungsdatum ignorieren:

source: Images in WODs can be downloaded to the local media library when a WOD is first displayed. By default images are loaded from the original Wodify location. Featured images in automated posts are always downloaded to the media library.
de_de: Bilder in WODs können in die Medienbibliothek heruntergeladen werden, wenn das WOD angezeigt wird. Standardmäßig werden die Bilder von der ursprünglichen Wodify-Adresse angezeigt. Beitragsbilder in automatisierten Beiträgen werden immer in die Medienbibliothek geladen.

source: Immediately
de_de: Sofort

source: Include components
de_de: Eingeschlossene Komponenten

source: Included and excluded components are comma separated lists of WOD components to limit the output to (include) or to skip in output (exclude). Use "Header" for the WOD header section, "Announcements for the respective section.
de_de: Eingeschlossene und ausgeschlossene Komponenten werden als Komma-separierte Listen von WOD-Komponenten angegeben, auf die die Ausgabe zu begrenzen (eingeschlossen) ist, oder die nicht angezeigt werden sollen (ausgeschlossen). Verwende "Header" für den Überschriftenabschnitt des WODs, "Announcements" für Ankündigungen.

source: Insert a link to a Wodify application web page (user must be logged in or login manually) or the Wodify homepage
de_de: Füge einen link zur Wodify Webanwendung (der Benutzer muss dort angemeldet sein oder sich manuell einloggen) oder zur Wodify Homepage.

source: Insert a list of upcoming classes of selected programs, including schema.org markup for search engines
de_de: Zeige eine Liste von zukünftigen Classes inklusive schema.org Markup für Suchmaschinen

source: Insert a logo link to the Wodify WOD page.
de_de: Fügt einen Logo-Link zur Wodify-WOD-Seite ein.

source: Insert text link to the Wodify calendar to open in a new tab
de_de: Fügt einen Textlink zum Wodify-Kalender ein, der sich im neuen Tab öffnet.

source: Integrate Wodify into Wordpress
de_de: Integration von Wodify in Wordpress

source: Last week
de_de: Letzte Woche

source: Location address from Wodify
de_de: Adresse der Location aus Wodify

source: Location image
de_de: Location Bild/Logo

source: Location name from Wodify
de_de: Name der Location in Wodify

source: Location name from Wodify, defaults to setting from settings page.
de_de: Location Name aus Wodify. Vorgabewert ist die Einstellung auf der Allgemeinen Einstellungsseite.

source: Magic number
de_de: Magische Zahl

source: Manual / Draft
de_de: Manuell / Entwurf

source: Name of the program to display the WOD for, defaults to the program chosen from the settings page.
de_de: Program Name aus Wodify. Vorgabewert ist die Einstellung auf der Allgemeinen Einstellungsseite .

source: Name of Wodify class
de_de: Name der Wodify Class

source: Name of Wodify program (Event name)
de_de: Name des Wodify Programs

source: Next week
de_de: Nächste Woche

source: No
de_de: Nein

source: No classes caching
de_de: Kalender-Caching deaktivieren

source: No upcoming classes.
de_de: Keine bevorstehenden Kurse.

source: No upcoming events.
de_de: Keine anstehenden Events.

source: No WOD available
de_de: Kein WOD verfügbar

source: No WOD available.
de_de: Kein WOD verfügbar.

source: No WOD posting
de_de: Keine WOD-Beiträge erstellen

source: Number of classes to display without scrolling:
de_de: Anzahl der ohne scrollen anzuzeigenden Kurse:

source: Number of days to find classes in the future. Defaults to 7 (one week)
de_de: Anzahl zukünftiger Tage, für die Classes angezeigt werden sollen.

source: Open
de_de: Offen

source: Output a selected WOD into a post or page.
de_de: Zeigt ein ausgewähltes WOD in einem Beitrag oder auf einer Seite an.

source: Phone number
de_de: Telefonnummer

source: Please add any extra JSON code, that you would like to add to the event markup. Anything specified here will be added on top-level at the end of each event markup.
de_de: Bitte füge hier jeglichen zusätzlichen JSON code ein, den du dem Event Markup hinzufügen möchtest. Dieser Code wird auf oberster Ebene am Ende jedes Event Markups eingefügt.

source: Please decide what the default for showing WOD images is. You can override the setting for each widget, shortcode or automated post.
de_de: Bitte lege den Vorgabewert für die Anzeige von Bildern in WODs fest. Du kannst diese Einstellung zusätzlich separat für alle Widgets, Shortcodes und automatisierten Beiträgen festlegen.

source: Please send your donation via Paypal by clicking here.
de_de: Klicke hier, um via Paypal zu spenden.

source: Please specify setting for the different Wodify programs. These will be used to determine what and how classes are displayed.
de_de: Bitte gib die Einstellungen für die verschiedenen Wodify Programme an. Diese werden verwendet um festzulegen, wie und welche Kurse angezeigt werden.

source: Please specify WOD publishing settings for the different Wodify programs. If you have multiple Wodify Locations settings can differ per location.
de_de: Bitte wähle die Einstellungen zur WOD-Veröffentlichung für die unterschiedlichen Wodify Programme. Wenn du mehrere Locations hast, können sich die Einstellungen je nach Location unterscheiden.

source: Post author
de_de: Beitragsautor

source: Post Images
de_de: Bilder

source: Post Thumbnail
de_de: Als Beitragsbild

source: Post title
de_de: Beitragstitel

source: Program
de_de: Programm

source: Program color
de_de: Programm Farbe

source: Program name
de_de: Programm-Name

source: Program Settings
de_de: Programm-Einstellungen

source: Publish offset in hours:
de_de: Veröffentlichungs-Offset in Stunden:

source: Publishing settings
de_de: Veröffentlichungseinstellungen

source: Remove line
de_de: Zeile löschen

source: Reservation status
de_de: Reserverierungsstatus

source: REST-API active
de_de: REST API aktiv
